test/k6/output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test/k6/basic-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m00.9s/2m00.0s

running (0m01.9s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m01.9s/2m00.0s

running (0m02.9s), 002/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 002/100 VUs  0m02.9s/2m00.0s

running (0m03.9s), 002/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m03.9s/2m00.0s

running (0m04.9s), 003/100 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 003/100 VUs  0m04.9s/2m00.0s

running (0m05.9s), 003/100 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 003/100 VUs  0m05.9s/2m00.0s

running (0m06.9s), 004/100 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 004/100 VUs  0m06.9s/2m00.0s

running (0m07.9s), 004/100 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 004/100 VUs  0m07.9s/2m00.0s

running (0m08.9s), 005/100 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 005/100 VUs  0m08.9s/2m00.0s

running (0m09.9s), 005/100 VUs, 3 complete and 0 interrupted iterations
default   [   8% ] 005/100 VUs  0m09.9s/2m00.0s

running (0m10.9s), 005/100 VUs, 4 complete and 0 interrupted iterations
default   [   9% ] 005/100 VUs  0m10.9s/2m00.0s

running (0m11.9s), 006/100 VUs, 5 complete and 0 interrupted iterations
default   [  10% ] 006/100 VUs  0m11.9s/2m00.0s

running (0m12.9s), 006/100 VUs, 6 complete and 0 interrupted iterations
default   [  11% ] 006/100 VUs  0m12.9s/2m00.0s

running (0m13.9s), 007/100 VUs, 6 complete and 0 interrupted iterations
default   [  12% ] 007/100 VUs  0m13.9s/2m00.0s

running (0m14.9s), 007/100 VUs, 8 complete and 0 interrupted iterations
default   [  12% ] 007/100 VUs  0m14.9s/2m00.0s

running (0m15.9s), 008/100 VUs, 9 complete and 0 interrupted iterations
default   [  13% ] 008/100 VUs  0m15.9s/2m00.0s

running (0m16.9s), 008/100 VUs, 11 complete and 0 interrupted iterations
default   [  14% ] 008/100 VUs  0m16.9s/2m00.0s

running (0m17.9s), 009/100 VUs, 12 complete and 0 interrupted iterations
default   [  15% ] 009/100 VUs  0m17.9s/2m00.0s

running (0m18.9s), 009/100 VUs, 13 complete and 0 interrupted iterations
default   [  16% ] 009/100 VUs  0m18.9s/2m00.0s

running (0m19.9s), 009/100 VUs, 15 complete and 0 interrupted iterations
default   [  17% ] 009/100 VUs  0m19.9s/2m00.0s

running (0m20.9s), 010/100 VUs, 17 complete and 0 interrupted iterations
default   [  17% ] 010/100 VUs  0m20.9s/2m00.0s

running (0m21.9s), 011/100 VUs, 19 complete and 0 interrupted iterations
default   [  18% ] 011/100 VUs  0m21.9s/2m00.0s

running (0m22.9s), 012/100 VUs, 21 complete and 0 interrupted iterations
default   [  19% ] 012/100 VUs  0m22.9s/2m00.0s

running (0m23.9s), 013/100 VUs, 22 complete and 0 interrupted iterations
default   [  20% ] 013/100 VUs  0m23.9s/2m00.0s

running (0m24.9s), 014/100 VUs, 24 complete and 0 interrupted iterations
default   [  21% ] 014/100 VUs  0m24.9s/2m00.0s

running (0m25.9s), 015/100 VUs, 27 complete and 0 interrupted iterations
default   [  22% ] 015/100 VUs  0m25.9s/2m00.0s

running (0m26.9s), 016/100 VUs, 29 complete and 0 interrupted iterations
default   [  22% ] 016/100 VUs  0m26.9s/2m00.0s

running (0m27.9s), 017/100 VUs, 33 complete and 0 interrupted iterations
default   [  23% ] 017/100 VUs  0m27.9s/2m00.0s

running (0m28.9s), 018/100 VUs, 35 complete and 0 interrupted iterations
default   [  24% ] 018/100 VUs  0m28.9s/2m00.0s

running (0m29.9s), 019/100 VUs, 38 complete and 0 interrupted iterations
default   [  25% ] 019/100 VUs  0m29.9s/2m00.0s

running (0m31.6s), 020/100 VUs, 42 complete and 0 interrupted iterations
default   [  26% ] 020/100 VUs  0m30.9s/2m00.0s

running (0m32.6s), 021/100 VUs, 45 complete and 0 interrupted iterations
default   [  27% ] 021/100 VUs  0m31.9s/2m00.0s

running (0m33.6s), 022/100 VUs, 49 complete and 0 interrupted iterations
default   [  27% ] 022/100 VUs  0m32.9s/2m00.0s

running (0m34.6s), 023/100 VUs, 53 complete and 0 interrupted iterations
default   [  28% ] 023/100 VUs  0m33.9s/2m00.0s

running (0m35.6s), 024/100 VUs, 56 complete and 0 interrupted iterations
default   [  29% ] 024/100 VUs  0m34.9s/2m00.0s

running (0m36.6s), 025/100 VUs, 62 complete and 0 interrupted iterations
default   [  30% ] 025/100 VUs  0m35.9s/2m00.0s

running (0m37.6s), 026/100 VUs, 66 complete and 0 interrupted iterations
default   [  31% ] 026/100 VUs  0m36.9s/2m00.0s

running (0m38.6s), 027/100 VUs, 71 complete and 0 interrupted iterations
default   [  32% ] 027/100 VUs  0m37.9s/2m00.0s

running (0m39.6s), 028/100 VUs, 76 complete and 0 interrupted iterations
default   [  32% ] 028/100 VUs  0m38.9s/2m00.0s

running (0m40.6s), 029/100 VUs, 80 complete and 0 interrupted iterations
default   [  33% ] 029/100 VUs  0m39.9s/2m00.0s

running (0m41.6s), 030/100 VUs, 86 complete and 0 interrupted iterations
default   [  34% ] 030/100 VUs  0m40.9s/2m00.0s

running (0m42.6s), 031/100 VUs, 92 complete and 0 interrupted iterations
default   [  35% ] 031/100 VUs  0m41.9s/2m00.0s

running (0m43.6s), 032/100 VUs, 98 complete and 0 interrupted iterations
default   [  36% ] 032/100 VUs  0m42.9s/2m00.0s

running (0m44.6s), 033/100 VUs, 104 complete and 0 interrupted iterations
default   [  37% ] 033/100 VUs  0m43.9s/2m00.0s

running (0m45.6s), 034/100 VUs, 109 complete and 0 interrupted iterations
default   [  37% ] 034/100 VUs  0m44.9s/2m00.0s

running (0m46.6s), 035/100 VUs, 116 complete and 0 interrupted iterations
default   [  38% ] 035/100 VUs  0m45.9s/2m00.0s

running (0m47.6s), 036/100 VUs, 123 complete and 0 interrupted iterations
default   [  39% ] 036/100 VUs  0m46.9s/2m00.0s

running (0m48.6s), 037/100 VUs, 130 complete and 0 interrupted iterations
default   [  40% ] 037/100 VUs  0m47.9s/2m00.0s

running (0m49.6s), 038/100 VUs, 137 complete and 0 interrupted iterations
default   [  41% ] 038/100 VUs  0m48.9s/2m00.0s

running (0m50.6s), 039/100 VUs, 143 complete and 0 interrupted iterations
default   [  42% ] 039/100 VUs  0m49.9s/2m00.0s

running (0m51.6s), 040/100 VUs, 151 complete and 0 interrupted iterations
default   [  42% ] 040/100 VUs  0m50.9s/2m00.0s

running (0m52.6s), 041/100 VUs, 159 complete and 0 interrupted iterations
default   [  43% ] 041/100 VUs  0m51.9s/2m00.0s

running (0m53.6s), 042/100 VUs, 166 complete and 0 interrupted iterations
default   [  44% ] 042/100 VUs  0m52.9s/2m00.0s

running (0m54.6s), 043/100 VUs, 174 complete and 0 interrupted iterations
default   [  45% ] 043/100 VUs  0m53.9s/2m00.0s

running (0m55.6s), 044/100 VUs, 182 complete and 0 interrupted iterations
default   [  46% ] 044/100 VUs  0m54.9s/2m00.0s

running (0m56.6s), 045/100 VUs, 191 complete and 0 interrupted iterations
default   [  47% ] 045/100 VUs  0m55.9s/2m00.0s

running (0m57.6s), 046/100 VUs, 200 complete and 0 interrupted iterations
default   [  47% ] 046/100 VUs  0m56.9s/2m00.0s

running (0m58.6s), 047/100 VUs, 208 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  0m57.9s/2m00.0s

running (0m59.6s), 048/100 VUs, 217 complete and 0 interrupted iterations
default   [  49% ] 048/100 VUs  0m58.9s/2m00.0s

running (1m00.6s), 049/100 VUs, 226 complete and 0 interrupted iterations
default   [  50% ] 049/100 VUs  0m59.9s/2m00.0s

running (1m01.6s), 051/100 VUs, 235 complete and 0 interrupted iterations
default   [  51% ] 051/100 VUs  1m00.9s/2m00.0s

running (1m02.6s), 052/100 VUs, 246 complete and 0 interrupted iterations
default   [  52% ] 052/100 VUs  1m01.9s/2m00.0s

running (1m04.4s), 053/100 VUs, 255 complete and 0 interrupted iterations
default   [  52% ] 053/100 VUs  1m02.9s/2m00.0s

running (1m05.4s), 054/100 VUs, 265 complete and 0 interrupted iterations
default   [  53% ] 054/100 VUs  1m03.9s/2m00.0s

running (1m06.4s), 056/100 VUs, 275 complete and 0 interrupted iterations
default   [  54% ] 056/100 VUs  1m04.9s/2m00.0s

running (1m07.4s), 057/100 VUs, 286 complete and 0 interrupted iterations
default   [  55% ] 057/100 VUs  1m05.9s/2m00.0s

running (1m08.4s), 058/100 VUs, 298 complete and 0 interrupted iterations
default   [  56% ] 058/100 VUs  1m06.9s/2m00.0s

running (1m09.4s), 059/100 VUs, 306 complete and 0 interrupted iterations
default   [  57% ] 059/100 VUs  1m07.9s/2m00.0s

running (1m10.4s), 061/100 VUs, 317 complete and 0 interrupted iterations
default   [  57% ] 061/100 VUs  1m08.9s/2m00.0s

running (1m11.3s), 062/100 VUs, 326 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  1m09.7s/2m00.0s

running (1m11.3s), 062/100 VUs, 326 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  1m09.7s/2m00.0s

running (1m11.4s), 062/100 VUs, 328 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  1m09.9s/2m00.0s

running (1m11.5s), 062/100 VUs, 328 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  1m10.0s/2m00.0s

running (1m11.5s), 062/100 VUs, 328 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  1m10.0s/2m00.0s

running (1m11.5s), 062/100 VUs, 328 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  1m10.0s/2m00.0s

running (1m11.5s), 062/100 VUs, 328 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  1m10.0s/2m00.0s

running (1m12.4s), 063/100 VUs, 339 complete and 0 interrupted iterations
default   [  59% ] 063/100 VUs  1m10.9s/2m00.0s

running (1m13.4s), 064/100 VUs, 351 complete and 0 interrupted iterations
default   [  60% ] 064/100 VUs  1m11.9s/2m00.0s

running (1m14.4s), 066/100 VUs, 364 complete and 0 interrupted iterations
default   [  61% ] 066/100 VUs  1m12.9s/2m00.0s

running (1m15.4s), 067/100 VUs, 375 complete and 0 interrupted iterations
default   [  62% ] 067/100 VUs  1m13.9s/2m00.0s

running (1m16.4s), 068/100 VUs, 390 complete and 0 interrupted iterations
default   [  62% ] 068/100 VUs  1m14.9s/2m00.0s

running (1m17.4s), 069/100 VUs, 402 complete and 0 interrupted iterations
default   [  63% ] 069/100 VUs  1m15.9s/2m00.0s

running (1m18.4s), 071/100 VUs, 415 complete and 0 interrupted iterations
default   [  64% ] 071/100 VUs  1m16.9s/2m00.0s

running (1m19.4s), 072/100 VUs, 430 complete and 0 interrupted iterations
default   [  65% ] 072/100 VUs  1m17.9s/2m00.0s

running (1m20.4s), 073/100 VUs, 441 complete and 0 interrupted iterations
default   [  66% ] 073/100 VUs  1m18.9s/2m00.0s

running (1m21.4s), 074/100 VUs, 456 complete and 0 interrupted iterations
default   [  67% ] 074/100 VUs  1m19.9s/2m00.0s

running (1m22.4s), 076/100 VUs, 470 complete and 0 interrupted iterations
default   [  67% ] 076/100 VUs  1m20.9s/2m00.0s

running (1m22.7s), 076/100 VUs, 472 complete and 0 interrupted iterations
default   [  68% ] 076/100 VUs  1m21.1s/2m00.0s

running (1m22.7s), 076/100 VUs, 472 complete and 0 interrupted iterations
default   [  68% ] 076/100 VUs  1m21.1s/2m00.0s

running (1m22.7s), 076/100 VUs, 472 complete and 0 interrupted iterations
default   [  68% ] 076/100 VUs  1m21.1s/2m00.0s

running (1m22.7s), 076/100 VUs, 472 complete and 0 interrupted iterations
default   [  68% ] 076/100 VUs  1m21.1s/2m00.0s

running (1m22.7s), 076/100 VUs, 472 complete and 0 interrupted iterations
default   [  68% ] 076/100 VUs  1m21.2s/2m00.0s

running (1m23.4s), 077/100 VUs, 485 complete and 0 interrupted iterations
default   [  68% ] 077/100 VUs  1m21.9s/2m00.0s

running (1m24.4s), 078/100 VUs, 497 complete and 0 interrupted iterations
default   [  69% ] 078/100 VUs  1m22.9s/2m00.0s

running (1m25.4s), 079/100 VUs, 511 complete and 0 interrupted iterations
default   [  70% ] 079/100 VUs  1m23.9s/2m00.0s

running (1m26.4s), 081/100 VUs, 526 complete and 0 interrupted iterations
default   [  71% ] 081/100 VUs  1m24.9s/2m00.0s

running (1m27.4s), 082/100 VUs, 539 complete and 0 interrupted iterations
default   [  72% ] 082/100 VUs  1m25.9s/2m00.0s

running (1m28.4s), 083/100 VUs, 557 complete and 0 interrupted iterations
default   [  72% ] 083/100 VUs  1m26.9s/2m00.0s

running (1m29.4s), 084/100 VUs, 573 complete and 0 interrupted iterations
default   [  73% ] 084/100 VUs  1m27.9s/2m00.0s

running (1m30.4s), 086/100 VUs, 590 complete and 0 interrupted iterations
default   [  74% ] 086/100 VUs  1m28.9s/2m00.0s

running (1m31.4s), 087/100 VUs, 606 complete and 0 interrupted iterations
default   [  75% ] 087/100 VUs  1m29.9s/2m00.0s

running (1m32.4s), 088/100 VUs, 621 complete and 0 interrupted iterations
default   [  76% ] 088/100 VUs  1m30.9s/2m00.0s

running (1m33.4s), 089/100 VUs, 639 complete and 0 interrupted iterations
default   [  77% ] 089/100 VUs  1m31.9s/2m00.0s

running (1m34.4s), 091/100 VUs, 654 complete and 0 interrupted iterations
default   [  77% ] 091/100 VUs  1m32.9s/2m00.0s

running (1m35.4s), 092/100 VUs, 668 complete and 0 interrupted iterations
default   [  78% ] 092/100 VUs  1m33.9s/2m00.0s

running (1m37.2s), 093/100 VUs, 686 complete and 0 interrupted iterations
default   [  79% ] 093/100 VUs  1m34.9s/2m00.0s

running (1m38.2s), 094/100 VUs, 703 complete and 0 interrupted iterations
default   [  80% ] 094/100 VUs  1m35.9s/2m00.0s

running (1m39.2s), 096/100 VUs, 721 complete and 0 interrupted iterations
default   [  81% ] 096/100 VUs  1m36.9s/2m00.0s

running (1m40.2s), 097/100 VUs, 742 complete and 0 interrupted iterations
default   [  82% ] 097/100 VUs  1m37.9s/2m00.0s

running (1m41.2s), 098/100 VUs, 760 complete and 0 interrupted iterations
default   [  82% ] 098/100 VUs  1m38.9s/2m00.0s

running (1m42.2s), 099/100 VUs, 779 complete and 0 interrupted iterations
default   [  83% ] 099/100 VUs  1m39.9s/2m00.0s

running (1m43.2s), 100/100 VUs, 796 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m40.9s/2m00.0s

running (1m44.2s), 100/100 VUs, 814 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  1m41.9s/2m00.0s

running (1m45.2s), 097/100 VUs, 835 complete and 0 interrupted iterations
default   [  86% ] 097/100 VUs  1m42.9s/2m00.0s

running (1m46.2s), 093/100 VUs, 855 complete and 0 interrupted iterations
default   [  87% ] 093/100 VUs  1m43.9s/2m00.0s

running (1m47.2s), 089/100 VUs, 873 complete and 0 interrupted iterations
default   [  87% ] 089/100 VUs  1m44.9s/2m00.0s

running (1m48.2s), 083/100 VUs, 896 complete and 0 interrupted iterations
default   [  88% ] 083/100 VUs  1m45.9s/2m00.0s

running (1m49.2s), 078/100 VUs, 914 complete and 0 interrupted iterations
default   [  89% ] 078/100 VUs  1m46.9s/2m00.0s

running (1m50.2s), 073/100 VUs, 932 complete and 0 interrupted iterations
default   [  90% ] 073/100 VUs  1m47.9s/2m00.0s

running (1m51.2s), 069/100 VUs, 948 complete and 0 interrupted iterations
default   [  91% ] 069/100 VUs  1m48.9s/2m00.0s

running (1m52.2s), 063/100 VUs, 962 complete and 0 interrupted iterations
default   [  92% ] 063/100 VUs  1m49.9s/2m00.0s

running (1m53.2s), 059/100 VUs, 979 complete and 0 interrupted iterations
default   [  92% ] 059/100 VUs  1m50.9s/2m00.0s

running (1m54.2s), 053/100 VUs, 992 complete and 0 interrupted iterations
default   [  93% ] 053/100 VUs  1m51.9s/2m00.0s

running (1m55.2s), 048/100 VUs, 1005 complete and 0 interrupted iterations
default   [  94% ] 048/100 VUs  1m52.9s/2m00.0s

running (1m56.2s), 042/100 VUs, 1017 complete and 0 interrupted iterations
default   [  95% ] 042/100 VUs  1m53.9s/2m00.0s

running (1m57.2s), 038/100 VUs, 1025 complete and 0 interrupted iterations
default   [  96% ] 038/100 VUs  1m54.9s/2m00.0s

running (1m58.2s), 031/100 VUs, 1038 complete and 0 interrupted iterations
default   [  97% ] 031/100 VUs  1m55.9s/2m00.0s

running (1m59.2s), 027/100 VUs, 1045 complete and 0 interrupted iterations
default   [  97% ] 027/100 VUs  1m56.9s/2m00.0s

running (2m00.2s), 022/100 VUs, 1053 complete and 0 interrupted iterations
default   [  98% ] 022/100 VUs  1m57.9s/2m00.0s

running (2m01.2s), 017/100 VUs, 1059 complete and 0 interrupted iterations
default   [  99% ] 017/100 VUs  1m58.9s/2m00.0s

running (2m02.2s), 015/100 VUs, 1063 complete and 0 interrupted iterations
default   [ 100% ] 015/100 VUs  1m59.9s/2m00.0s

running (2m03.2s), 010/100 VUs, 1068 complete and 0 interrupted iterations
default ↓ [ 100% ] 015/100 VUs  2m0s

running (2m04.2s), 006/100 VUs, 1072 complete and 0 interrupted iterations
default ↓ [ 100% ] 015/100 VUs  2m0s

running (2m05.2s), 003/100 VUs, 1075 complete and 0 interrupted iterations
default ↓ [ 100% ] 015/100 VUs  2m0s

running (2m06.2s), 002/100 VUs, 1076 complete and 0 interrupted iterations
default ↓ [ 100% ] 015/100 VUs  2m0s


  █ TOTAL RESULTS 

    checks_total.......: 10780  84.93597/s
    checks_succeeded...: 98.43% 10611 out of 10780
    checks_failed......: 1.56%  169 out of 10780

    ✗ status is 200
      ↳  97% — ✓ 5230 / ✗ 160
    ✗ response time < 500ms
      ↳  99% — ✓ 5381 / ✗ 9

    HTTP
    http_req_duration..............: avg=25.88ms min=2.28ms med=16.91ms max=913.14ms p(90)=47.94ms p(95)=74.23ms
      { expected_response:true }...: avg=26.38ms min=4.41ms med=17.24ms max=913.14ms p(90)=48.66ms p(95)=75.14ms
    http_req_failed................: 2.96%  160 out of 5390
    http_reqs......................: 5390   42.467985/s

    EXECUTION
    iteration_duration.............: avg=5.12s   min=5.03s  med=5.1s    max=5.45s    p(90)=5.22s   p(95)=5.28s  
    iterations.....................: 1078   8.493597/s
    vus............................: 2      min=1           max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 350 MB 2.8 MB/s
    data_sent......................: 930 kB 7.3 kB/s



running (2m06.9s), 000/100 VUs, 1078 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m0s